source/org_posts/2014-03-05-octopress-setup-with-github-and-org-mode-v2.org
#+BEGIN_HTML
---
layout: post
title: "Org-Mode Octopress Setup v2"
date: 2014-03-05 19:37
comments: true
categories: [octopress, org-mode]
alias: /tips/org-octopress/index.html
keywords: octopress, github, org-mode, emacs, livereload
description: Installing Octopress with github hosting, Org Mode markup, and Live-Reload, updated for org-mode 8.2x and Emacs 24
---
#+END_HTML

/Note: This is a refresh of my original post from April, 2013 to adjust for Emacs 24.3 and org-mode 8.2.x/

WordPress seemed like a good blogging platform, but it just didn't feel right. I
spend all my day editing text files using vim key-bindings, and I love [[http://orgmode.org/][Org Mode]]
for all non-coding writing. If you don't know Org Mode, it's like having
Markdown mode on steroids. You can have a numbered list in Markdown, but
org-mode lets you re-order the list, and that's just the beginning. Editing blog
documents in the WordPress editor felt almost as bad as being told to use MS
Word. I found that ergonomics of Org Mode, including all the goodness of recent
versions of [[http://www.gnu.org/software/emacs/][Emacs]], including [[http://www.emacswiki.org/emacs/Evil][Evil]] (Vim emulation), just made organization of
creative thoughts so much more enjoyable.

So I bit the bullet one weekend, and dove into [[http://octopress.org/][Octopress]], publishing my first
article, [[http://www.railsonmaui.com/blog/2013/04/27/octopress-setup-with-github-and-org-mode/][Octopress Setup with Github, Org Mode, and LiveReload]]. The solution
presented in that article [[http://blog.paphus.com/blog/2012/08/01/introducing-octopress-blogging-for-org-mode/][Introducing Octopress Blogging for Org-Mode]] stopped
working when I upgraded Emacs to 24.3 and org-mode to 8.2.x. Here's a rehash of
my original article updated to the latest software versions as of March, 2014.

If you used to writing real web applications, rather than know the intricacies
of a giant monolithic blogging platform, then the [[http://octopress.org/docs/theme/template/][customization of Octopress]]
seems so much more straightforward. This is so much more like the Unix
philosophy that so many of us love, which is small and modular, rather than
monolithic.

#+begin_html
<!-- more -->
#+end_html

I like [[https://github.com/robdodson/robdodson.github.com/blob/source/source/_posts/2012-04-30-custom-domain-with-octopress-and-github-pages.markdown][Rob Dodson's summary]] (noting Org Mode plus Emacs):

- [[http://octopress.org/][Octopress]] is a blogging framework written by [[http://brandonmathis.com/][Brandon Mathis]] ([[https://twitter.com/#!/imathis][@imathis]]) which
  sits on top of [[https://github.com/mojombo/jekyll][Jekyll]]. Jekyll is a static site generator, meaning there's no
  database associated with your blog. Instead of writing everything in a WSYWIG
  linked to MySQL (like Wordpress or Blogger) you produce text files using
  Markdown which are then converted to static HTML. There are 3 huge benefits to
  this approach. First, writing in Markdown (*org-mode* for me) is awesome. Once
  you learn the syntax it's incredibly fast and you don't have to spend time
  playing with a tiny little editor window just to add /some/ *style* to your
  posts. Second, writing in your favorite text editor is also awesome. I produce
  everything in Sublime Text 2 (*Emacs* for me) and every day I discover new
  tricks to make the process better. If you've ever had to write a blog post
  using one of those horrible little TinyMCE editors you will appreciate this
  feature. And lastly, static HTML is *fast*.

This article should be useful for:
  1. Any interest in using org-mode to publish to Octopress including some
     reasons I use Org Mode (with Emacs).
  2. Some explanation of what Octopress and git are doing.
  3. Anybody curious about how using free github pages works to host Octopress.

Incidentally, since my blog is hosted using github pages, the source code and
configuration I use to generate it can all be found [[https://github.com/justin808/justin808.github.io][here]]. See the notes below on
the difference between the =source= and =master= branches.
  
* Basic setup
1. [[http://robdodson.me/blog/2012/04/30/custom-domain-with-octopress-and-github-pages/][Rob Dodson on Octopress]]: Start off with these instructions from this posting
   on April 30th, 2012. There are a few differences worth noting:
   1. You should change the .rvmrc to a .ruby-version file
   2. Github recommends your deployment repository be named =yourname.github.io=,
      not =yourname.github.com=.
   3. After you run =rake setup_github_pages= and before running =rake
      generate=, you should run =rake install=. If you forget, there's a clear
      message indicating this omission.
2. Customize =octopress/_config.yml=. The yaml file contains descriptions.
3. Update the DNS to use your custom domain if you wish: [[https://help.github.com/articles/setting-up-a-custom-domain-with-pages][Github directions on
   setting up a custom domain]]
4. At this point, you can create a post:
  #+BEGIN_SRC bash
  rake new_post["my post name"]
  #+END_SRC

  Create a page:
  #+BEGIN_SRC bash
  rake new_page["my page name"]
  #+END_SRC

  Generate and deploy:
  #+BEGIN_SRC bash
  rake gen_deploy
  #+END_SRC

  Watch the site and regenerate when it changes:
  #+BEGIN_SRC bash
  rake watch
  #+END_SRC

  Preview the site in a web browser:
  #+BEGIN_SRC bash
  rake preview
  #+END_SRC

  See all the available rake options:
  #+BEGIN_SRC bash
  rake -T
  #+END_SRC

  Save changes to source branch:
  #+BEGIN_SRC bash
  git add .
  git commit -m "save changes to source"
  git push origin source
  #+END_SRC

* Some Perspectives on how Octopress Works
** Posts
*Posts* are created using the rake task =rake new_post["Post Title"]=. The key things about a post are:
1. File is located in =source/_posts.
2. File has a header containing the meta-data for the post. The post URL and
   date are determined by the by the =title= and =date= fields. If you want to
   change the date of your post, then you change the meta-data. Changing the
   file name is useful only for file navigation. Here's a [[https://gist.github.com/justin808/5550381][gist for a rake task
   to update the file names to match the metadata]].

** Pages
*Pages* are created using the rake task =rake new_page["Page Title"]=. The key
things about a page are:
1. Files are located in =source/page-title=
2. File has a header containing the meta-data for the post.

I use "Pages" for things like [[http://www.railsonmaui.com/about][my "about" page.]]

* POW
POW allows you to point your browser to =http://octopress.dev= to see your local,
unpublished Octopress website. It's very convenient to not have to remember to
run a local server, and it works great with LiveReload. Scroll to the bottom of
this link for details on [[http://octopress.org/docs/blogging/][POW]]. The alternative to running POW is to run =rake
preview= and then point your browser at =http://0.0.0.0:4000= (or whatever port
you configured).

