source/_posts/2014-03-05-octopress-setup-with-github-and-org-mode-v2.html
---
layout: post
title: "Org-Mode Octopress Setup v2"
date: 2014-03-05 19:37
comments: true
categories: [octopress, org-mode]
redirect_from: /tips/org-octopress/index.html
keywords: octopress, github, org-mode, emacs, livereload
description: Installing Octopress with github hosting, Org Mode markup, and Live-Reload, updated for org-mode 8.2x and Emacs 24
---

<p>
<i>Note: This is a refresh of my original post from April, 2013 to adjust for Emacs 24.3 and org-mode 8.2.x</i>
</p>

<p>
WordPress seemed like a good blogging platform, but it just didn't feel right. I
spend all my day editing text files using vim key-bindings, and I love <a href="http://orgmode.org/">Org Mode</a>
for all non-coding writing. If you don't know Org Mode, it's like having
Markdown mode on steroids. You can have a numbered list in Markdown, but
org-mode lets you re-order the list, and that's just the beginning. Editing blog
documents in the WordPress editor felt almost as bad as being told to use MS
Word. I found that ergonomics of Org Mode, including all the goodness of recent
versions of <a href="http://www.gnu.org/software/emacs/">Emacs</a>, including <a href="http://www.emacswiki.org/emacs/Evil">Evil</a> (Vim emulation), just made organization of
creative thoughts so much more enjoyable.
</p>

<p>
So I bit the bullet one weekend, and dove into <a href="http://octopress.org/">Octopress</a>, publishing my first
article, <a href="http://www.railsonmaui.com/blog/2013/04/27/octopress-setup-with-github-and-org-mode/">Octopress Setup with Github, Org Mode, and LiveReload</a>. The solution
presented in that article <a href="http://blog.paphus.com/blog/2012/08/01/introducing-octopress-blogging-for-org-mode/">Introducing Octopress Blogging for Org-Mode</a> stopped
working when I upgraded Emacs to 24.3 and org-mode to 8.2.x. Here's a rehash of
my original article updated to the latest software versions as of March, 2014.
</p>

<p>
If you used to writing real web applications, rather than know the intricacies
of a giant monolithic blogging platform, then the <a href="http://octopress.org/docs/theme/template/">customization of Octopress</a>
seems so much more straightforward. This is so much more like the Unix
philosophy that so many of us love, which is small and modular, rather than
monolithic.
</p>

<!-- more -->

<p>
I like <a href="https://github.com/robdodson/robdodson.github.com/blob/source/source/_posts/2012-04-30-custom-domain-with-octopress-and-github-pages.markdown">Rob Dodson's summary</a> (noting Org Mode plus Emacs):
</p>

<ul class="org-ul">
<li><a href="http://octopress.org/">Octopress</a> is a blogging framework written by <a href="http://brandonmathis.com/">Brandon Mathis</a> (<a href="https://twitter.com/#!/imathis">@imathis</a>) which
sits on top of <a href="https://github.com/mojombo/jekyll">Jekyll</a>. Jekyll is a static site generator, meaning there's no
database associated with your blog. Instead of writing everything in a WSYWIG
linked to MySQL (like Wordpress or Blogger) you produce text files using
Markdown which are then converted to static HTML. There are 3 huge benefits to
this approach. First, writing in Markdown (<b>org-mode</b> for me) is awesome. Once
you learn the syntax it's incredibly fast and you don't have to spend time
playing with a tiny little editor window just to add <i>some</i> <b>style</b> to your
posts. Second, writing in your favorite text editor is also awesome. I produce
everything in Sublime Text 2 (<b>Emacs</b> for me) and every day I discover new
tricks to make the process better. If you've ever had to write a blog post
using one of those horrible little TinyMCE editors you will appreciate this
feature. And lastly, static HTML is <b>fast</b>.
</li>
</ul>

<p>
This article should be useful for:
</p>
<ol class="org-ol">
<li>Any interest in using org-mode to publish to Octopress including some
reasons I use Org Mode (with Emacs).
</li>
<li>Some explanation of what Octopress and git are doing.
</li>
<li>Anybody curious about how using free github pages works to host Octopress.
</li>
</ol>

<p>
Incidentally, since my blog is hosted using github pages, the source code and
configuration I use to generate it can all be found <a href="https://github.com/justin808/justin808.github.io">here</a>. See the notes below on
the difference between the <code>source</code> and <code>master</code> branches.
</p>

<!-- more -->

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Basic setup</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><a href="http://robdodson.me/blog/2012/04/30/custom-domain-with-octopress-and-github-pages/">Rob Dodson on Octopress</a>: Start off with these instructions from this posting
on April 30th, 2012. There are a few differences worth noting:
<ol class="org-ol">
<li>You should change the .rvmrc to a .ruby-version file
</li>
<li>Github recommends your deployment repository be named <code>yourname.github.io</code>,
not <code>yourname.github.com</code>.
</li>
<li>After you run <code>rake setup_github_pages</code> and before running <code>rake
      generate</code>, you should run <code>rake install</code>. If you forget, there's a clear
message indicating this omission.
</li>
</ol>
</li>
<li>Customize <code>octopress/_config.yml</code>. The yaml file contains descriptions.
</li>
<li>Update the DNS to use your custom domain if you wish: <a href="https://help.github.com/articles/setting-up-a-custom-domain-with-pages">Github directions on
setting up a custom domain</a>
</li>
<li>At this point, you can create a post:
{% codeblock lang:bash %}
rake new_post["my post name"]
{% endcodeblock %}

<p>
Create a page:
</p>
{% codeblock lang:bash %}
rake new_page["my page name"]
{% endcodeblock %}

<p>
Generate and deploy:
</p>
{% codeblock lang:bash %}
rake gen_deploy
{% endcodeblock %}

<p>
Watch the site and regenerate when it changes:
</p>
{% codeblock lang:bash %}
rake watch
{% endcodeblock %}

<p>
Preview the site in a web browser:
</p>
{% codeblock lang:bash %}
rake preview
{% endcodeblock %}

<p>
See all the available rake options:
</p>
{% codeblock lang:bash %}
rake -T
{% endcodeblock %}

<p>
Save changes to source branch:
</p>
{% codeblock lang:bash %}
git add .
git commit -m "save changes to source"
git push origin source
{% endcodeblock %}
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Some Perspectives on how Octopress Works</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Posts</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b>Posts</b> are created using the rake task <code>rake new_post["Post Title"]</code>. The key things about a post are:
</p>
<ol class="org-ol">
<li>File is located in =source/_posts.
</li>
<li>File has a header containing the meta-data for the post. The post URL and
date are determined by the by the <code>title</code> and <code>date</code> fields. If you want to
change the date of your post, then you change the meta-data. Changing the
file name is useful only for file navigation. Here's a <a href="https://gist.github.com/justin808/5550381">gist for a rake task
to update the file names to match the metadata</a>.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Pages</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>Pages</b> are created using the rake task <code>rake new_page["Page Title"]</code>. The key
things about a page are:
</p>
<ol class="org-ol">
<li>Files are located in <code>source/page-title</code>
</li>
<li>File has a header containing the meta-data for the post.
</li>
</ol>

<p>
I use "Pages" for things like <a href="http://www.railsonmaui.com/about">my "about" page.</a>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">POW</h2>
<div class="outline-text-2" id="text-3">
<p>
POW allows you to point your browser to <code>http://octopress.dev</code> to see your local,
unpublished Octopress website. It's very convenient to not have to remember to
run a local server, and it works great with LiveReload. Scroll to the bottom of
this link for details on <a href="http://octopress.org/docs/blogging/">POW</a>. The alternative to running POW is to run <code>rake
preview</code> and then point your browser at <code>http://0.0.0.0:4000</code> (or whatever port
you configured).
</p>
</div>
</div>
