source/org_posts/2014-03-05-octopress-setup-with-github-and-org-mode-v2.org
* Automatically Generating the Site
Start a shell tab running this command: =rake generate && rake watch=. Edit a
file in markdown or follow the instructions below to use org-mode.

* Org-Mode
You can skip this section if you're not interested in org-mode. However, it's
super cool!
** Why org-mode for blog publishing?
[[http://orgmode.org/][Org-mode]] offers quite a bit more than plain markdown. It's quite the *hacker's
delight* for note taking and authoring of blog articles. Down below I list a few
reasons why org-mode. Here's a few org-mode features I love (Some are Emacs
ones):
1. All headers and list items can be reordered with minimal keystrokes (think
   super powerful outliner).
2. Numbered lists.
3. Editable tables in text editor, with movable columns, movable rows.
4. Ergonomics of insertion of URLs and images.
5. Includes the basics of markdown, such as source code blocks and much more.

** Org-mode Integration
The [[https://github.com/yoshinari-nomura/org-octopress][org-octopress]] plugin automates the process of converting an org-mode
document (=.org= file) in =source/org_posts= into a =.html= document in
=source/_posts=. Once the html document is saved in _posts, the =rake watch=
task picks up the change and deploys the file. *Neat!*

Here are the basic steps:
1. Install Emacs 24.3 and use the package manager to install org-mode and
   [[https://github.com/yoshinari-nomura/org-octopress][org-octopress]].
2. See my Emacs configuration below.
3. Note, there are two ways to use org-octopress. I do not use its features to
   automate the setup of the directories. This automated setup does not provide
   a way to have "pages". As of March, 2014, you can only have "posts". Instead,
   my configuration below handles the mapping of directories.
4. +Images work fine.+ Well, almost fine. The big gotcha is that the standard
   inclusion of images in org-mode results in broken paths at deployment. The
   workaround is to embed the [[http://octopress.org/docs/plugins/image-tag/][Octopress syntax for an image]], and to place the
   images under source/images. Note, you'll want to be sure to use an absolute
   path, or else your article might look OK on the home page, but might now work
   in the postings directory. If I'm creating a document with many images, I'll
   group the images for that document in a sub-directory of images named like
   the document. This is how it should look. The trick is to place the
   octopress =img= directive within a HTML begin/end block.

   {% img /images/2013-04-27-octopress-setup-with-github-and-org-mode/org-mode-images.png %}
5. *Links*: This is key thing to get right. It's critical to understand the
   issues links, or else you'll have one of these issues:
   1. Links work when you test your blog locally using =pow=, but not when you
      go to your published website. This happens if you use a relative link from
      blog articles, because blog articles sometimes appear on your home page
      and sometimes under the =/blog= directory. You have to use your domain
      address to link from blog articles to other articles on your blog.
   2. You'd like your local links to point to the correct local spot. You can do
      this for links on static pages, but just not blog articles. Thus, for
      non-blog articles, it's preferable to use the =file:= relative path format
      (just not =file:/= absolute path and not =file:~/=).
   *Here's the rules:*
    
   Links from static pages, relatively specified to other static pages and to
   posts. Ensure that there's no =/= immediately following =file:=. For example:
   #+BEGIN_EXAMPLE
   [[file:telecommuting.html][Why telecommuting works and how I maximize productivity]]
   #+END_EXAMPLE
   Or if the link is one level under the current directory:
   #+BEGIN_EXAMPLE
   [[file:misc/telecommuting.html][Why telecommuting works and how I maximize productivity]]
   #+END_EXAMPLE
   Links from a /page/ to a /post/ can use a relative link like this.
   /Important: you must use the =YYYY/MM/DD/blog-title/index.html= format! and you must specify the article title./
   #+BEGIN_EXAMPLE
   [[file:../blog/2013/04/27/octopress-setup-with-github-and-org-mode/index.html][Org-Mode Octopress Setup V2]]
   #+END_EXAMPLE 
   *However*, links from posts to other posts require an absolute URL using your
   published domain name. The big gotcha is that blog posts sometimes are shown
   on the home page and sometimes inside of the blog directory. To avoid
   trouble, you need to follow a format as this example shows. It's easiest to
   copy the URL from the browser address bar.
   #+BEGIN_EXAMPLE
   [[http://www.railsonmaui.com/blog/2013/05/08/strategies-for-rails-logging-and-error-handling/][Strategies for Rails Logging and Error Handling]]
   #+END_EXAMPLE
   I tried using a =file:../blog= syntax, but that either would work on the home
   page or in the specific blog article, but not both. =http:/blog= links would
   work in Chrome but not mobile Safari. Hopefully, one day we'll be able to
   specify relative links from blog article to blog article. /For now, this is a
   big *gotcha*./
   *Tip*: You can specify relative links between org pages using the =.org= file
   suffix, rather than html. The earlier example could have been specified as:
   #+BEGIN_EXAMPLE
   [[file:misc/telecommuting.org][Why telecommuting works and how I maximize productivity]]
   #+END_EXAMPLE
   That allows you to put your cursor on the link in emacs, and hit F12 to go
   the org file! I've got =F12= mapped to =org-open-at-point=. Awesome!
6. Bold and italic styling (text inside of stars and /) was a bit of mystery
   using the standard theme. Octopress has styling for =<strong>= and =<em>=. Org-mode spits out =<b>= and
   =<i>= tags.
   Add this to =sass/custom/_fonts.scss=.
   #+BEGIN_SRC css sass/custom/_fonts.scss
   b { font-weight: bold; }
   i { font-style: italic; }
   #+END_SRC

   Code styling (text inside of equals) =like this= did not work after a code block unless I added
   the =div= tag to this line around 100 in =_syntax.scss=. You're just adding
   the =div= selector.
   #+BEGIN_SRC css
   // Sometimes html gen by org-mode misses p or li tags, so add div to the mix
   div, p, li {
     code {
       @extend .mono;
   #+END_SRC

   
* Useful Scripts
+ Just configure =OCTO_HOME=
+ Emacs tip: Visit the created file by placing cursor over file name and then hit =Ctrl-x, f=.
#+BEGIN_SRC bash
export OCTO_HOME=~/octopress
ogen () {
  cd $OCTO_HOME; rake generate; cd -
}

osave () {
  cd $OCTO_HOME; git commit -am "Updates" && git push origin source; cd -
}

odeploy () {
  cd $OCTO_HOME; osave; rake gen_deploy; cd -
}

# this one is for orgmode only
opost() {
  cd $OCTO_HOME
  output=$(rake new_post["${1}"])
  new_file=$(echo $output | awk '{print $4}')
  base=$(basename $new_file)
  new_location=$OCTO_HOME/source/org_posts/
  mv $OCTO_HOME/$new_file $new_location
  echo created $new_location/$base
  cd -
}

opage() {
  cd $OCTO_HOME
  rake new_page["${1}"]
  cd -
}
#+END_SRC

