source/_posts/2014-03-05-octopress-setup-with-github-and-org-mode-v2.html
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Automatically Generating the Site</h2>
<div class="outline-text-2" id="text-4">
<p>
Start a shell tab running this command: <code>rake generate &amp;&amp; rake watch</code>. Edit a
file in markdown or follow the instructions below to use org-mode.
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Org-Mode</h2>
<div class="outline-text-2" id="text-5">
<p>
You can skip this section if you're not interested in org-mode. However, it's
super cool!
</p>
</div>
<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Why org-mode for blog publishing?</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a href="http://orgmode.org/">Org-mode</a> offers quite a bit more than plain markdown. It's quite the <b>hacker's
delight</b> for note taking and authoring of blog articles. Down below I list a few
reasons why org-mode. Here's a few org-mode features I love (Some are Emacs
ones):
</p>
<ol class="org-ol">
<li>All headers and list items can be reordered with minimal keystrokes (think
super powerful outliner).
</li>
<li>Numbered lists.
</li>
<li>Editable tables in text editor, with movable columns, movable rows.
</li>
<li>Ergonomics of insertion of URLs and images.
</li>
<li>Includes the basics of markdown, such as source code blocks and much more.
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">Org-mode Integration</h3>
<div class="outline-text-3" id="text-5-2">
<p>
The <a href="https://github.com/yoshinari-nomura/org-octopress">org-octopress</a> plugin automates the process of converting an org-mode
document (<code>.org</code> file) in <code>source/org_posts</code> into a <code>.html</code> document in
<code>source/_posts</code>. Once the html document is saved in _posts, the <code>rake watch</code>
task picks up the change and deploys the file. <b>Neat!</b>
</p>

<p>
Here are the basic steps:
</p>
<ol class="org-ol">
<li>Install Emacs 24.3 and use the package manager to install org-mode and
   <a href="https://github.com/yoshinari-nomura/org-octopress">org-octopress</a>.
</li>
<li>See my Emacs configuration below.
</li>
<li>Note, there are two ways to use org-octopress. I do not use its features to
automate the setup of the directories. This automated setup does not provide
a way to have "pages". As of March, 2014, you can only have "posts". Instead,
my configuration below handles the mapping of directories.
</li>
<li><del>Images work fine.</del> Well, almost fine. The big gotcha is that the standard
inclusion of images in org-mode results in broken paths at deployment. The
workaround is to embed the <a href="http://octopress.org/docs/plugins/image-tag/">Octopress syntax for an image</a>, and to place the
images under source/images. Note, you'll want to be sure to use an absolute
path, or else your article might look OK on the home page, but might now work
in the postings directory. If I'm creating a document with many images, I'll
group the images for that document in a sub-directory of images named like
the document. This is how it should look. The trick is to place the
octopress <code>img</code> directive within a HTML begin/end block.

<p>
{% img /images/2013-04-27-octopress-setup-with-github-and-org-mode/org-mode-images.png %}
</p>
</li>
<li><b>Links</b>: This is key thing to get right. It's critical to understand the
issues links, or else you'll have one of these issues:
<ol class="org-ol">
<li>Links work when you test your blog locally using <code>pow</code>, but not when you
go to your published website. This happens if you use a relative link from
blog articles, because blog articles sometimes appear on your home page
and sometimes under the <code>/blog</code> directory. You have to use your domain
address to link from blog articles to other articles on your blog.
</li>
<li>You'd like your local links to point to the correct local spot. You can do
this for links on static pages, but just not blog articles. Thus, for
non-blog articles, it's preferable to use the <code>file:</code> relative path format
(just not <code>file:/</code> absolute path and not <code>file:~/</code>).
</li>
</ol>
<p>
<b>Here's the rules:</b>
</p>

<p>
Links from static pages, relatively specified to other static pages and to
posts. Ensure that there's no <code>/</code> immediately following <code>file:</code>. For example:
</p>
<pre class="example">
[[file:telecommuting.html][Why telecommuting works and how I maximize productivity]]
</pre>
<p>
Or if the link is one level under the current directory:
</p>
<pre class="example">
[[file:misc/telecommuting.html][Why telecommuting works and how I maximize productivity]]
</pre>
<p>
Links from a <i>page</i> to a <i>post</i> can use a relative link like this.
<i>Important: you must use the <code>YYYY/MM/DD/blog-title/index.html</code> format! and you must specify the article title.</i>
</p>
<pre class="example">
[[file:../blog/2013/04/27/octopress-setup-with-github-and-org-mode/index.html][Org-Mode Octopress Setup V2]]
</pre>
<p>
<b>However</b>, links from posts to other posts require an absolute URL using your
published domain name. The big gotcha is that blog posts sometimes are shown
on the home page and sometimes inside of the blog directory. To avoid
trouble, you need to follow a format as this example shows. It's easiest to
copy the URL from the browser address bar.
</p>
<pre class="example">
[[http://www.railsonmaui.com/blog/2013/05/08/strategies-for-rails-logging-and-error-handling/][Strategies for Rails Logging and Error Handling]]
</pre>
<p>
I tried using a <code>file:../blog</code> syntax, but that either would work on the home
page or in the specific blog article, but not both. <code>http:/blog</code> links would
work in Chrome but not mobile Safari. Hopefully, one day we'll be able to
specify relative links from blog article to blog article. <i>For now, this is a
big <b>gotcha</b>.</i>
<b>Tip</b>: You can specify relative links between org pages using the <code>.org</code> file
suffix, rather than html. The earlier example could have been specified as:
</p>
<pre class="example">
[[file:misc/telecommuting.org][Why telecommuting works and how I maximize productivity]]
</pre>
<p>
That allows you to put your cursor on the link in emacs, and hit F12 to go
the org file! I've got <code>F12</code> mapped to <code>org-open-at-point</code>. Awesome!
</p>
</li>
<li>Bold and italic styling (text inside of stars and /) was a bit of mystery
using the standard theme. Octopress has styling for <code>&lt;strong&gt;</code> and <code>&lt;em&gt;</code>. Org-mode spits out <code>&lt;b&gt;</code> and
<code>&lt;i&gt;</code> tags.
Add this to <code>sass/custom/_fonts.scss</code>.
{% codeblock lang:css %}
b { font-weight: bold; }
i { font-style: italic; }
{% endcodeblock %}

<p>
Code styling (text inside of equals) <code>like this</code> did not work after a code block unless I added
the <code>div</code> tag to this line around 100 in <code>_syntax.scss</code>. You're just adding
the <code>div</code> selector.
</p>
{% codeblock lang:css %}
// Sometimes html gen by org-mode misses p or li tags, so add div to the mix
div, p, li {
  code {
    @extend .mono;
{% endcodeblock %}
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Useful Scripts</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Just configure <code>OCTO_HOME</code>
</li>
<li>Emacs tip: Visit the created file by placing cursor over file name and then hit <code>Ctrl-x, f</code>.
</li>
</ul>
{% codeblock lang:bash %}
export OCTO_HOME=~/octopress
ogen () {
  cd $OCTO_HOME; rake generate; cd -
}

osave () {
  cd $OCTO_HOME; git commit -am "Updates" && git push origin source; cd -
}

odeploy () {
  cd $OCTO_HOME; osave; rake gen_deploy; cd -
}

# this one is for orgmode only
opost() {
  cd $OCTO_HOME
  output=$(rake new_post["${1}"])
  new_file=$(echo $output | awk '{print $4}')
  base=$(basename $new_file)
  new_location=$OCTO_HOME/source/org_posts/
  mv $OCTO_HOME/$new_file $new_location
  echo created $new_location/$base
  cd -
}

opage() {
  cd $OCTO_HOME
  rake new_page["${1}"]
  cd -
}
{% endcodeblock %}
</div>
</div>
