source/org_posts/2014-03-05-octopress-setup-with-github-and-org-mode-v2.org
* Emacs setup

#+BEGIN_SRC common-lisp
;; Justin's customized org to octopress publishing
;; Based on
;; org-mode 8.x+
;; http://blog.paphus.com/blog/2012/08/01/introducing-octopress-blogging-for-org-mode/
;; https://github.com/yoshinari-nomura/org-octopress
;; See http://wwww.railsonmaui.com

;; the converter from org to jekyll html files
(require 'ox-jekyll)

;; I prefer to use the plugin for source formatting. More colors!
(setq org-jekyll-use-src-plugin t)

;; We're going to create the yaml-front-matter in the rake task
(setq org-jekyll-include-yaml-front-matter nil)

(defun save-then-publish ()
  (interactive)
  (save-buffer)
  (org-save-all-org-buffers)
  (org-publish-current-project))

(setq org-export-with-sub-superscripts `{})

(setq my-common-octopress-settings
      '(:base-extension "org"
                        :with-toc nil
                        :with-sub-superscript nil 
                        :section-numbers nil 
                        :recursive t
                        :publishing-function org-jekyll-publish-to-html
                        :headline-levels 4
                        :body-only t))

(setq my-static-directories '("about" "meta" "tips"))
(setq my-base-directory "~/j/railsonmaui-octopress/source")

(defun my-create-octopress-static (prj)
  (let ((base-dir (expand-file-name prj)))
    `(,prj . (:base-directory ,base-dir
                              :publishing-directory ,base-dir
                              ,@my-common-octopress-settings))))

(defun my-static-components ()
  (mapcar 'my-create-octopress-static my-static-directories))

(let ((default-directory my-base-directory))
(setq org-publish-project-alist
      `(
        ;; components
        ("blog" . (:components ("blog-org" "blog-extra" "about" "meta" "tips")))

        ;; blog articles
        ("blog-org" .  (:base-directory ,(expand-file-name "org_posts")
                                        :publishing-directory ,(expand-file-name "_posts")
                                        ,@my-common-octopress-settings))
        ("blog-extra" . (:base-directory ,(expand-file-name "org_posts")
                                         :publishing-directory ,(expand-file-name ".")
                                         :base-extension "css\\|pdf\\|png\\|jpg\\|gif\\|svg"
                                         :publishing-function org-publish-attachment
                                         :recursive t
                                         :author nil))

        ;; static articles
        ,@(my-static-components))))
#+END_SRC


* Deploying to Github: Directory Structure of Octopress and the master and source Git Branches
Github offers free hosting of both the blog deployment and source. You're
looking at the deployment right now. You can find the source here at
[[https://github.com/justin808/justin808.github.io][my git repo justin808.github.io]]. I doubt you could beat the price, performance, and
convenience. You can look inside of this repo, clone it, etc. and you have
everything that it took to make this blog.

I originally was quite confused by the concept of using two separate git
branches to make up what gets deployed on the live website versus the git
repository of my articles. Plus, there's the issue of Octopress git repository
that you clone when starting out. Eventually, I figured out that the two branches
simply contain different files, with one containing the original Octopress
files. Here's a few screen grabs that might clarify the situation for you.

Don't forget that you never push to the master branch, but rather the =rake
deploy= task does it for you. Instead, you run =git push origin source= to push
the content of your blog to github.

The =octopress/public= directory corresponds to what you'll find on the github
site for your deployment (master branch).

{% img /images/2013-04-27-octopress-setup-with-github-and-org-mode/public-dir-corresponds-master-branch.png %}

The octopress/.gitignore file contains entries like =public=, which essentially
keeps the =rake generate= files out of the source branch.

Here's the github master branch right after creation. Note the correspondence
with =public=. This is what gets deployed as your blog.
{% img /images/2013-04-27-octopress-setup-with-github-and-org-mode/github-master-branch.png %}

Here's the github source branch. This contains the octopress environment, as
well as your customizations and blog posts.
#+begin_html
{% img /images/2013-04-27-octopress-setup-with-github-and-org-mode/github-source-branch.png %}
#+end_html

* Useful Links
1. [[http://webdesign.tutsplus.com/tutorials/applications/getting-started-with-octopress/][Getting Started with Octopress]]: Nice overall tutorial. Very current!
   March 2013.
2. [[http://robdodson.me/blog/2012/04/30/custom-domain-with-octopress-and-github-pages][Rob Dodson on Octopress]]: Most of the instructions I show below are from this
   posting on April 30th, 2012.
3. [[http://joelmccracken.github.io/entries/octopress-is-pretty-sweet/][Joel McCracken on Octopress]]: Use Jekyll? You Really Should Be Using Octopress
4. [[https://help.github.com/articles/setting-up-a-custom-domain-with-pages][Github directions on setting up a custom domain]]
5. [[http://code.dblock.org/octopress-setting-up-a-blog-and-contributing-to-an-existing-one][dblock.org Article on Octopress]]: A good explanation from Jan 17, 2012,
   especially on the difference of the source and master branches.
6. [[http://blog.paphus.com/blog/2012/08/01/introducing-octopress-blogging-for-org-mode/][Introducing Octopress Blogging for Org-Mode]]: For org-mode. See below.
7. [[http://hiltmon.com/blog/2013/04/17/18-months-of-octopress/][18 Months of Octopress]]: Nice article on why Octopress was worth the switch.
8. [[http://odino.org/bash-aliases-for-octopress/][Shell Aliases for Octopress]]: Save time with these shortcuts
9. [[https://github.com/yoshinari-nomura/org-octopress][org-octopress package]]: The connection between emacs/org-mode and octopress.
10. [[http://www.brokenlinkcheck.com/broken-links.php][Check your blog for broken links]]: Super useful to scan for broken links.
    This link is more efficient than the [[http://validator.w3.org/checklink][W3C Link Checker]]

* Live Reload
Previously, I tried to get Live Reload to work. It would be neat it worked, but
I ran into a snag. The browser gets triggered to update before the Jekyll page
is generated. I tried some various techniques for working around this, but
nothing seemed reliable. If you figure out how to fix this, please let me know.

* Parting words...
Thanks in advance for any suggestions on this article. I hope you find it
helpful. 
